karthikcit/STM32F411RE_Nucleo/Drivers/Inc/usart_driver.h
/*
 * usart_driver.h
 *
 *  Created on: 29-Jul-2020
 *      Author: KarthikM
 */

#ifndef INC_USART_DRIVER_H_
#define INC_USART_DRIVER_H_

#include "stm32f411xx.h"
#include "rcc_clock.h"



/*
 * Configuration structure for USARTx peripheral
 */
typedef struct
{
	uint8_t		USART_Mode;
	uint32_t	USART_Baud;
	uint8_t 	USART_NoOfStopBits;
	uint8_t 	USART_WordLength;
	uint8_t 	USART_ParityControl;
	uint8_t 	USART_HWFlowControl;
}USART_Config_t;


/*
 * Handle structure for USARTx peripheral
 */
typedef struct
{
	USART_RegDef_t *pUSARTx;
	USART_Config_t   USART_Config;
}USART_Handle_t;

/* USART SR BIT POSITIONS /Flags */
#define USART_FLAG_CTS 		9	//CTS flag
#define USART_FLAG_LBD 		8	//LIN break detection flag
#define USART_FLAG_TXE 		7	//Transmit data register empty
#define USART_FLAG_TC 		6	//Transmission complete
#define USART_FLAG_RXNE 	5	//Read data register not empty
#define USART_FLAG_IDLE 	4	//Idle line detected
#define USART_FLAG_ORE	 	3	//Over Run
#define USART_FLAG_NF	 	2	//Noise Detected
#define USART_FLAG_FE	 	1	//Frame Error
#define USART_FLAG_PE	 	0	//Parity Error
/* USART CR1 BIT POSITION MACROS */
#define SEND_BREAK_BIT			1
#define RECEIVER_ENABLE_BIT		2
#define TRANSMITTER_ENABLE_BIT	3
#define PARITY_SELECTION_BIT	9
#define PARITYCONTROL_EN_BIT	10
#define WORD_LENGTH_BIT			12
#define USART_ENABLE_BIT		13

/* USART CR2 BIT POSITION MACROS */
#define LINMODE_EN_BIT			14
#define NO_OF_STOP_BITS_BIT		12
#define CLOCKENABLE_BIT			11
#define CLK_POL_BIT				10
#define CLK_PHASE_BIT			9
#define	LBCL_BIT				8
#define LBDIE_BIT				6
#define LBDL_BIT				5
#define ADDRESS_BIT				0

/* USART CR3 BIT POSITION MACROS */
#define	CTS_ENABLE_BIT		9
#define	RTS_ENABLE_BIT		8

/*
 *@USART_Mode
 *Possible options for USART_Mode
 */
#define USART_MODE_ONLY_TX	0
#define USART_MODE_ONLY_RX	1
#define USART_MODE_TXRX  	2

/*
 *@USART_Baud
 *Possible options for USART_Baud
 */
#define USART_STD_BAUD_1200					1200
#define USART_STD_BAUD_2400					400
#define USART_STD_BAUD_9600					9600
#define USART_STD_BAUD_19200 				19200
#define USART_STD_BAUD_38400 				38400
#define USART_STD_BAUD_57600 				57600
#define USART_STD_BAUD_115200 				115200
#define USART_STD_BAUD_230400 				230400
#define USART_STD_BAUD_460800 				460800
#define USART_STD_BAUD_921600 				921600
#define USART_STD_BAUD_2M 					2000000
#define SUART_STD_BAUD_3M 					3000000


/*
 *@USART_ParityControl
 *Possible options for USART_ParityControl
 */
#define USART_PARITY_EN_ODD   2
#define USART_PARITY_EN_EVEN  1
#define USART_PARITY_DISABLE   0

/*
 *@USART_WordLength
 *Possible options for USART_WordLength
 */
#define USART_WORDLEN_8BITS  0
#define USART_WORDLEN_9BITS  1

/*
 *@USART_NoOfStopBits
 *Possible options for USART_NoOfStopBits
 */
#define USART_STOPBITS_1     0
#define USART_STOPBITS_0_5   1
#define USART_STOPBITS_2     2
#define USART_STOPBITS_1_5   3

/*
 *@USART_HWFlowControl
 *Possible options for USART_HWFlowControl
 */
#define USART_HW_FLOW_CTRL_NONE    	0
#define USART_HW_FLOW_CTRL_CTS    	1
#define USART_HW_FLOW_CTRL_RTS    	2
#define USART_HW_FLOW_CTRL_CTS_RTS	3



/******************************************************************************************
 *								APIs supported by this driver
 *		 For more information about the APIs check the function definitions
 ******************************************************************************************/
/*
 * Peripheral Clock setup
 */
void USART_PeriClockControl(USART_RegDef_t *pUSARTx, uint8_t ENorDIS);

/*
 * Init and De-init
 */
void USART_Init(USART_Handle_t *pUSARTHandle);
void USART_DeInit(USART_RegDef_t *pUSARTx);


/*
 * Data Send and Receive
 */
//void USART_SendData(USART_RegDef_t *pUSARTx,uint8_t *pTxBuffer, uint32_t Len);
void USART_SendData(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Len);
//void USART_ReceiveData(USART_RegDef_t *pUSARTx, uint8_t *pRxBuffer, uint32_t Len);
void USART_ReceiveData(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len);
uint8_t USART_SendDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pTxBuffer, uint32_t Len);
uint8_t USART_ReceiveDataIT(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len);

/*
 * IRQ Configuration and ISR handling
 */
void USART_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi);
void USART_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority);
void USART_IRQHandling(USART_Handle_t *pHandle);

/*
 * Other Peripheral Control APIs
 */
void USART_PeripheralControl(USART_RegDef_t *pUSARTx, uint8_t EnOrDi);
uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx , uint32_t FlagName);
void USART_ClearFlag(USART_RegDef_t *pUSARTx, uint16_t StatusFlagName);

/*
 * Application callback
 */
void USART_ApplicationEventCallback(USART_Handle_t *pUSARTHandle,uint8_t AppEv);


#endif /* INC_USART_DRIVER_H_ */
